const handler = async (m, { conn }) => {
  const vi = ['https://telegra.ph/file/523e4cd6e968fcab7c160.mp4']

  let menu = `👋🏻 𝖧𝗈𝗅𝖺! 𝖻𝗂𝖾𝗇𝗏𝖾𝗇𝗂𝖽𝗈 𝖺𝗅 𝗆𝖾𝗇𝗎𝗀𝗋𝗎𝗉𝗈 𝖽𝖾 *𝖸𝖺𝗑𝗋𝖼𝗂𝗍𝗈𝗉 𝖨𝖠* 𝖺𝗊𝗎𝗂́ 𝖾𝗇𝖼𝗈𝗇𝗍𝗋𝖺𝗋𝖺𝗌 𝗅𝗈𝗌 𝖼𝗈𝗆𝖺𝗇𝖽𝗈𝗌 𝗉𝖺𝗋𝖺 𝗆𝖺𝗇𝗍𝖾𝗇𝖾𝗋 𝗎𝗇 𝗍𝗈𝗍𝖺𝗅 𝗈𝗋𝖽𝖾𝗇 𝖾𝗇 𝗍𝗎𝗌 𝖼𝗈𝗆𝗉𝖾𝗍𝗂𝗍𝗂𝗏𝗈𝗌!

✮,— \`𝖢𝖮𝖬𝖠𝖭𝖣𝖮𝖲 𝖣𝖤 𝖥𝖱𝖤𝖤 𝖥𝖨𝖱𝖤\` .ᐟᨮׁׅ֮.ᐟ
⭒ ִֶָ७ ꯭🥤˙⋆｡ -4𝘷𝘴4 𝘏𝘰𝘳𝘢 𝘺 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -6𝘷𝘴6 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -8𝘷𝘴8 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -12𝘷𝘴12 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -16𝘷𝘴16 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -20𝘷𝘴20 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -24𝘷𝘴24 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘪𝘯𝘵𝘦𝘳𝘯𝘢4𝘷𝘴4 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘪𝘯𝘵𝘦𝘳𝘯𝘢6𝘷𝘴6 𝘏𝘰𝘳𝘢 𝘠 𝘗𝘢𝘪𝘴
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘴𝘤𝘳𝘪𝘮

✮,— \`𝖬𝖠𝖯𝖠𝖲 𝖥𝖱𝖤𝖤 𝖥𝖨𝖱𝖤\` .ᐟᨮׁׅ֮.ᐟ
⭒ ִֶָ७ ꯭🏞️˙⋆｡ -𝖻𝖾𝗋𝗆𝗎𝖽𝖺
⭒ ִֶָ७ ꯭🌅˙⋆｡ -𝗉𝗎𝗋𝗀𝖺𝗍𝗈𝗋𝗂𝗈
⭒ ִֶָ७ ꯭🏜️˙⋆｡ -𝗄𝖺𝗅𝖺𝗁𝖺𝗋𝗂
⭒ ִֶָ७ ꯭🌄˙⋆｡ -𝗇𝖾𝗑𝗍𝖾𝗋𝗋𝖺
⭒ ִֶָ७ ꯭🏞️˙⋆｡ -𝖺𝗅𝗉𝖾𝗌

> © 𝖸𝖺𝗑𝗋𝖼𝗂𝗍𝗈𝗉 𝖨𝖠 𝖝 𝖸𝖺𝗑𝗋𝖼𝗂𝗍𝗈𝗉-𝗑𝗒𝗓
`

  await conn.sendMessage(m.chat, {
    react: { text: '🔥', key: m.key }
  })

  await conn.sendMessage(
    m.chat,
    {
      video: { url: vi[0] },
      caption: menu,
      gifPlayback: true,
      mentions: [m.sender]
    },
    { quoted: m }
  )
}

handler.customPrefix = /^\.?(menu3|menufreefire|menuff)$/i;
handler.command = new RegExp
export default handler